app/controllers/posts_controller.rb

 	def create
 		@post = Post.new(params[:post])

		  if @post.save
---
INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES ('teet', 'test', '2012-07-22 10:59:04.125994', '2012-07-22 10:59:04.125994')

	def update
	  @post = Post.find(params[:id])

	  if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
UPDATE "posts" SET "title" = 'teetasd', "text" = 'testaasd', "updated_at" = '2012-07-22 18:40:26.122693' WHERE "posts"."id" = 1